# SetLTGeneration

## Description
Sets the polyline line type generation

```pascal
PROCEDURE SetLTGeneration(ltGeneration : BOOLEAN);
```

```python
def vs.SetLTGeneration(ltGeneration):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ltGeneration|BOOLEAN|   |

## Examples
```pascal
SetLTGeneration(TRUE);
```
```python
import vs

# Sets the polyline line type generation.
ltGeneration = True

vs.SetLTGeneration(ltGeneration)
```

## Version
Availability: from Vectorworks 2020.5

## Category
* ImportExport